In [16]:
import numpy as np
import pandas as pd

In [17]:
#Cast a list for the index of a series

In [18]:
ser = pd.Series(data=[1,2,3,None,5,6,np.nan,8],index=list('abcdefgh'))

In [19]:
ser

a    1.0
b    2.0
c    3.0
d    NaN
e    5.0
f    6.0
g    NaN
h    8.0
dtype: float64

In [20]:
#you are unable to compaire Nan with == operator

In [21]:
#example - The following will not work

In [22]:
ser == np.nan

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h    False
dtype: bool

In [23]:
ser != np.nan

a    True
b    True
c    True
d    True
e    True
f    True
g    True
h    True
dtype: bool

In [24]:
#Proper check for NaN values

In [25]:
pd.isna(ser)

a    False
b    False
c    False
d     True
e    False
f    False
g     True
h    False
dtype: bool

In [29]:
#showing how Nan effect values when opertations are performed (addition,subtraction,multiplication,etc)

In [30]:
ser1 = pd.Series(data=[1,2,3,None,5,6,np.nan,8],index=list('abcdefgh'))
ser2 = pd.Series(data=[10,20,30,40,50,60,70,80],index=list('abcdefgh'))

In [27]:
ser1

a    1.0
b    2.0
c    3.0
d    NaN
e    5.0
f    6.0
g    NaN
h    8.0
dtype: float64

In [28]:
ser2

a    10
b    20
c    30
d    40
e    50
f    60
g    70
h    80
dtype: int64

In [31]:
ser1 + ser2

a    11.0
b    22.0
c    33.0
d     NaN
e    55.0
f    66.0
g     NaN
h    88.0
dtype: float64

In [32]:
#Nan effect any values they interact with

In [34]:
df1 = pd.DataFrame(data=[[1,2,3,np.nan,5],[6,np.nan,8,9,10]],index=list('XY'),columns=list('abcde'))
df2 = pd.DataFrame(data=[[10,20,30,40,50],[60,70,80,90,100]],index=list('XY'),columns=list('abcde'))

In [35]:
df1

   a    b  c    d   e
X  1  2.0  3  NaN   5
Y  6  NaN  8  9.0  10

In [36]:
df2

    a   b   c   d    e
X  10  20  30  40   50
Y  60  70  80  90  100

In [37]:
df1 + df2

    a     b   c     d    e
X  11  22.0  33   NaN   55
Y  66   NaN  88  99.0  110

In [39]:
df = pd.DataFrame(data=[[1,2,3,np.nan,5],
                        [6,np.nan,8,9,10],
                        [np.nan,np.nan,np.nan,np.nan,np.nan],
                        [60,70,80,90,100]],
                  index=list('XYZW'),
                 columns=list('abcde'))

In [40]:
df

      a     b     c     d      e
X   1.0   2.0   3.0   NaN    5.0
Y   6.0   NaN   8.0   9.0   10.0
Z   NaN   NaN   NaN   NaN    NaN
W  60.0  70.0  80.0  90.0  100.0

In [41]:
#drop all rows with all null values

In [42]:
df.dropna(axis = 0,how='all')

      a     b     c     d      e
X   1.0   2.0   3.0   NaN    5.0
Y   6.0   NaN   8.0   9.0   10.0
W  60.0  70.0  80.0  90.0  100.0

In [43]:
df

      a     b     c     d      e
X   1.0   2.0   3.0   NaN    5.0
Y   6.0   NaN   8.0   9.0   10.0
Z   NaN   NaN   NaN   NaN    NaN
W  60.0  70.0  80.0  90.0  100.0

In [44]:
df.dropna(axis = 0,how='any')

      a     b     c     d      e
W  60.0  70.0  80.0  90.0  100.0

In [45]:
#i want to keep rows that have atleast 4 non-null values

In [46]:
df.dropna(axis=0,how='any',thresh=4)

      a     b     c     d      e
X   1.0   2.0   3.0   NaN    5.0
Y   6.0   NaN   8.0   9.0   10.0
W  60.0  70.0  80.0  90.0  100.0

In [47]:
df

      a     b     c     d      e
X   1.0   2.0   3.0   NaN    5.0
Y   6.0   NaN   8.0   9.0   10.0
Z   NaN   NaN   NaN   NaN    NaN
W  60.0  70.0  80.0  90.0  100.0

In [48]:
df.dropna(axis=1,how='any',thresh=3)

      a     c      e
X   1.0   3.0    5.0
Y   6.0   8.0   10.0
Z   NaN   NaN    NaN
W  60.0  80.0  100.0

In [49]:
df

      a     b     c     d      e
X   1.0   2.0   3.0   NaN    5.0
Y   6.0   NaN   8.0   9.0   10.0
Z   NaN   NaN   NaN   NaN    NaN
W  60.0  70.0  80.0  90.0  100.0

In [ ]:
#Using inplace argument in dropna function will make fundemental changes to the df

In [50]:
#fill dataframe values (Nan)

In [51]:
df

      a     b     c     d      e
X   1.0   2.0   3.0   NaN    5.0
Y   6.0   NaN   8.0   9.0   10.0
Z   NaN   NaN   NaN   NaN    NaN
W  60.0  70.0  80.0  90.0  100.0

In [52]:
df.fillna(value='Missing')

         a        b        c        d        e
X      1.0      2.0      3.0  Missing      5.0
Y      6.0  Missing      8.0      9.0     10.0
Z  Missing  Missing  Missing  Missing  Missing
W     60.0     70.0     80.0     90.0    100.0

In [53]:
df.fillna(value=0)

      a     b     c     d      e
X   1.0   2.0   3.0   0.0    5.0
Y   6.0   0.0   8.0   9.0   10.0
Z   0.0   0.0   0.0   0.0    0.0
W  60.0  70.0  80.0  90.0  100.0

In [54]:
#fill missing data with avg

In [55]:
df

      a     b     c     d      e
X   1.0   2.0   3.0   NaN    5.0
Y   6.0   NaN   8.0   9.0   10.0
Z   NaN   NaN   NaN   NaN    NaN
W  60.0  70.0  80.0  90.0  100.0

In [57]:
#fill with the column mean
df.fillna(df.mean())

           a     b          c     d           e
X   1.000000   2.0   3.000000  49.5    5.000000
Y   6.000000  36.0   8.000000   9.0   10.000000
Z  22.333333  36.0  30.333333  49.5   38.333333
W  60.000000  70.0  80.000000  90.0  100.000000

In [58]:
#specify which columns to fill

In [60]:
df.fillna(value=df.mean()[['b','c']])

      a     b          c     d      e
X   1.0   2.0   3.000000   NaN    5.0
Y   6.0  36.0   8.000000   9.0   10.0
Z   NaN  36.0  30.333333   NaN    NaN
W  60.0  70.0  80.000000  90.0  100.0

In [61]:
df['b'].fillna(value=df['b'].mean())

X     2.0
Y    36.0
Z    36.0
W    70.0
Name: b, dtype: float64